<?php

namespace Database\Seeders;

use App\Models\TbFaculty;
use Illuminate\Database\Seeder;

class FacultySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $faculty = [
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาการศึกษาปฐมวัย'],
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาการประถมศึกษา'],
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาภาษาอังกฤษ'],
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาภาษาไทย'],
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาภาษาจีน'],
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาคอมพิวเตอร์'],
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาคณิศาสตร์'],
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาสังคมศึกษา'],
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาวิทยาศาสตร์ทั่วไป'],
            ['organizational' => 'คณะครุศาสตร์', 'major' => 'โปรแกรมวิชาพลศึกษา'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชารัฐประศาสนศาสตร์'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชานิติศาสตร์'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชาการพัฒนาสังคม'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชาภาษาอังกฤษ'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชาวิจิตรศิลป์และประยุกต์ศิลป์'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชาภาษาไทย'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชาบรรณารักษศาสตร์และสารสนเทศศาสตร์'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชาภูมิสารสนเทศ'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชาภาษาจีน'],
            ['organizational' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major' => 'โปรแกรมวิชาดนตรีศึกษา'],
            ['organizational' => 'คณะวิทยาการจัดการ', 'major' => 'โปรแกรมวิชาการบัญชี'],
            ['organizational' => 'คณะวิทยาการจัดการ', 'major' => 'โปรแกรมวิชาเอกการจัดการธุรกิจ'],
            ['organizational' => 'คณะวิทยาการจัดการ', 'major' => 'โปรแกรมวิชาเอกการตลาด'],
            ['organizational' => 'คณะวิทยาการจัดการ', 'major' => 'โปรแกรมวิชาเอกการเงิน'],
            ['organizational' => 'คณะวิทยาการจัดการ', 'major' => 'โปรแกรมวิชาเอกเทคโนโลยีธุรกิจดิจิทัล'],
            ['organizational' => 'คณะวิทยาการจัดการ', 'major' => 'โปรแกรมวิชาเอกการเป็นผู้ประกอบการ'],
            ['organizational' => 'คณะวิทยาการจัดการ', 'major' => 'โปรแกรมวิชาท่องเที่ยวและการโรงแรม'],
            ['organizational' => 'คณะวิทยาการจัดการ', 'major' => 'โปรแกรมวิชานิเทศศาสตร์'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชาวิทยาการคอมพิวเตอร์'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชาเทคโนโลยีสารสนเทศ'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชาฟิสิกส์'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชาชีววิทยา'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชาคณิตศาสตร์'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชาสาธารณสุขศาสตร์'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชานวัตกรรมและธุรกิจอาหาร'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชาเคมีและวิทยาศาสตร์สิ่งแวดล้อม วิชาเอกเคมี'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชาเคมีและวิทยาศาสตร์สิ่งแวดล้อม วิชาเอกเคมีอุตสาหกรรม'],
            ['organizational' => 'คณะวิทยาศาสตร์และเทคโนโลยี', 'major' => 'โปรแกรมวิชาเคมีและวิทยาศาสตร์สิ่งแวดล้อม วิชาเอกสิ่งแวดล้อม'],
            ['organizational' => 'คณะเทคโนอุตสาหกรรม', 'major' => 'โปรแกรมวิชาเทคโนโลยีวิศวกรรมไฟฟ้า'],
            ['organizational' => 'คณะเทคโนอุตสาหกรรม', 'major' => 'โปรแกรมวิชาเทคโนโลยีพลังงาน'],
            ['organizational' => 'คณะเทคโนอุตสาหกรรม', 'major' => 'โปรแกรมวิชาเทคโนโลยีวิศวกรรมโยธา'],
            ['organizational' => 'คณะเทคโนอุตสาหกรรม', 'major' => 'โปรแกรมวิชาเทคโนโลยีอุตสาหกรรม'],
            ['organizational' => 'คณะเทคโนอุตสาหกรรม', 'major' => 'โปรแกรมวิชาออกแบบผลิตภัณฑ์และกราฟิก'],
            ['organizational' => 'คณะเทคโนอุตสาหกรรม', 'major' => 'โปรแกรมวิชาเทคโนโลยีคอมพิวเตอร์'],
            ['organizational' => 'คณะเทคโนอุตสาหกรรม', 'major' => 'โปรแกรมวิชาการจัดการโลจิสติกส์'],
            ['organizational' => 'คณะเทคโนอุตสาหกรรม', 'major' => 'โปรแกรมวิชาอุตสาหกรรมศิลป์'],
            ['organizational' => 'มหาวิทยาลัยราชภัฏกำแพงเพชร แม่สอด', 'major' => '0'],
            ['organizational' => 'สถาบันวิจัยและพัฒนา', 'major' => '0'],
            ['organizational' => 'สำนักส่งเสริมวิชาการและงานทะเบียน', 'major' => '0'],
            ['organizational' => 'สำนักวิทยบริการและเทคโนโลยีสารสนเทศ', 'major' => '0'],
            ['organizational' => 'สำนักศิลปะและวัฒนธรรม', 'major' => '0'],
            ['organizational' => 'สำนักประกันคุณภาพการศึกษา', 'major' => '0'],
            ['organizational' => 'สำนักบริการวิชาการและจัดหารายได้', 'major' => '0'],
            ['organizational' => 'สำนักงานอธิการบดี', 'major' => '0'],
        ];

        foreach ($faculty as $key => $value) {
            TbFaculty::create($value);
        }
    }
}
